cases/validation/poiseuille_Bn0p70/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }

// Half-channel Poiseuille-Bingham:
//  H = 1 (after blockMesh scale 0.1, half-height = 1 m? No: vertices y in [0,10], scale 0.1 → [0,1], so H=1)
//  G = 5 (body force, kinematic)
//  Newtonian limit: u_max = G·H²/(2ν) = 5/(2·0.1) = 25
//  Bingham target Bn = τ_y/(G·H) = 0.5  →  τ_y = 2.5 (kinematic)

transportModel  Newtonian;     // ignored by viscoplasticAlgFoam (we use Bingham coefficients below)

nu      [0 2 -1 0 0 0 0]   0.1;
tau_y   [0 2 -2 0 0 0 0]   3.5;
r_alg   [0 2 -1 0 0 0 0]   0.1;
