cases/validation/poiseuille_Bn0p70/0.orig/gamma
FoamFile { version 2.0; format ascii; class volSymmTensorField; object gamma; }

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    walls         { type zeroGradient; }
    centreline    { type symmetryPlane; }

    #includeEtc "caseDicts/setConstraintTypes"
}
